performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
    - duration: 2
      arrivalRate: 2
      name: "Phase 2"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
  ##processor: "./myProcessor.js"
scenarios:
  - flow:
      - get:
          url: "/rest/v1/tasks"
      - post:
          url: "/rest/v1/tasks"
          json: 
            project_id: 2261438697
            content: "Challenge Task"
            due_string: "tomorrow at 12:00"
            due_lang: "en"
            priority": 4
          capture:
            json: "$.id"
            as: "idTask"
      - log: "Current id is {{ idTask }}"
      - get: 
          url: "/rest/v1/tasks/{{ idTask }}"
      - post:
          url: "/rest/v1/tasks/{{ idTask }}"
          json: 
            project_id: 2261438697
            content: "Updated Task"
            due_string: "tomorrow at 10:00"
            due_lang: "en"
            priority": 4
      - post:
          url: "/rest/v1/tasks/{{ idTask }}/close"
      - post:
          url: "/rest/v1/tasks/{{ idTask }}/reopen"
      - delete: 
          url: "/rest/v1/tasks/{{ idTask }}"

# For more information: https://artillery.io/docs/script-reference/